MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6012A/mcu.h
/* C2CFG2 */
/* Bitname _PRSEG cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH cannot be defined because it is used by more than one SFR */
/* Bitname _SAM cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PHTS cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH cannot be defined because it is used by more than one SFR */
/* Bitname _WAKFIL cannot be defined because it is used by more than one SFR */
/* Bitname _PRSEG0 cannot be defined because it is used by more than one SFR */
/* Bitname _PRSEG1 cannot be defined because it is used by more than one SFR */
/* Bitname _PRSEG2 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH0 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH1 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG1PH2 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH0 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH1 cannot be defined because it is used by more than one SFR */
/* Bitname _SEG2PH2 cannot be defined because it is used by more than one SFR */

/* C2INTF */
/* Bitname _RXB0IF cannot be defined because it is used by more than one SFR */
/* Bitname _RXB1IF cannot be defined because it is used by more than one SFR */
/* Bitname _TXB0IF cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1IF cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2IF cannot be defined because it is used by more than one SFR */
/* Bitname _ERRIF cannot be defined because it is used by more than one SFR */
/* Bitname _WAKIF cannot be defined because it is used by more than one SFR */
/* Bitname _IRXIF cannot be defined because it is used by more than one SFR */
/* Bitname _EWARN cannot be defined because it is used by more than one SFR */
/* Bitname _RXWARN cannot be defined because it is used by more than one SFR */
/* Bitname _TXWARN cannot be defined because it is used by more than one SFR */
/* Bitname _RXBP cannot be defined because it is used by more than one SFR */
/* Bitname _TXBP cannot be defined because it is used by more than one SFR */
/* Bitname _TXBO cannot be defined because it is used by more than one SFR */
/* Bitname _RXB1OVFL cannot be defined because it is used by more than one SFR */
/* Bitname _RXB0OVFL cannot be defined because it is used by more than one SFR */
/* Bitname _RX0IF cannot be defined because it is used by more than one SFR */
/* Bitname _RX1IF cannot be defined because it is used by more than one SFR */
/* Bitname _TX0IF cannot be defined because it is used by more than one SFR */
/* Bitname _TX1IF cannot be defined because it is used by more than one SFR */
/* Bitname _TX2IF cannot be defined because it is used by more than one SFR */
/* Bitname _IVRIF cannot be defined because it is used by more than one SFR */
/* Bitname _RXWAR cannot be defined because it is used by more than one SFR */
/* Bitname _TXWAR cannot be defined because it is used by more than one SFR */
/* Bitname _RXEP cannot be defined because it is used by more than one SFR */
/* Bitname _TXEP cannot be defined because it is used by more than one SFR */
/* Bitname _RX1OVR cannot be defined because it is used by more than one SFR */
/* Bitname _RX0OVR cannot be defined because it is used by more than one SFR */

/* C2INTE */
/* Bitname _RXB0IE cannot be defined because it is used by more than one SFR */
/* Bitname _RXB1IE cannot be defined because it is used by more than one SFR */
/* Bitname _TXB0IE cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1IE cannot be defined because it is used by more than one SFR */
/* Bitname _TXB2IE cannot be defined because it is used by more than one SFR */
/* Bitname _ERRIE cannot be defined because it is used by more than one SFR */
/* Bitname _WAKIE cannot be defined because it is used by more than one SFR */
/* Bitname _IRXIE cannot be defined because it is used by more than one SFR */
/* Bitname _RX0IE cannot be defined because it is used by more than one SFR */
/* Bitname _RX1IE cannot be defined because it is used by more than one SFR */
/* Bitname _TX0IE cannot be defined because it is used by more than one SFR */
/* Bitname _TX1IE cannot be defined because it is used by more than one SFR */
/* Bitname _TX2IE cannot be defined because it is used by more than one SFR */
/* Bitname _IVRIE cannot be defined because it is used by more than one SFR */

/* C2EC */
/* Bitname _REC0 cannot be defined because it is used by more than one SFR */
/* Bitname _REC1 cannot be defined because it is used by more than one SFR */
/* Bitname _REC2 cannot be defined because it is used by more than one SFR */
/* Bitname _REC3 cannot be defined because it is used by more than one SFR */
/* Bitname _REC4 cannot be defined because it is used by more than one SFR */
/* Bitname _REC5 cannot be defined because it is used by more than one SFR */
/* Bitname _REC6 cannot be defined because it is used by more than one SFR */
/* Bitname _REC7 cannot be defined because it is used by more than one SFR */
/* Bitname _TEC0 cannot be defined because it is used by more than one SFR */
/* Bitname _TEC1 cannot be defined because it is used by more than one SFR */
/* Bitname _TEC2 cannot be defined because it is used by more than one SFR */
/* Bitname _TEC3 cannot be defined because it is used by more than one SFR */
/* Bitname _TEC4 cannot be defined because it is used by more than one SFR */
/* Bitname _TEC5 cannot be defined because it is used by more than one SFR */
/* Bitname _TEC6 cannot be defined because it is used by more than one SFR */
/* Bitname _TEC7 cannot be defined because it is used by more than one SFR */

/* RCON */
#define _POR RCONbits.POR
#define _BOR RCONbits.BOR
#define _IDLE RCONbits.IDLE
#define _SLEEP RCONbits.SLEEP
#define _WDTO RCONbits.WDTO
#define _SWDTEN RCONbits.SWDTEN
#define _SWR RCONbits.SWR
#define _EXTR RCONbits.EXTR
#define _LVDL RCONbits.LVDL
#define _LVDEN RCONbits.LVDEN
#define _BGST RCONbits.BGST
#define _IOPUWR RCONbits.IOPUWR
#define _TRAPR RCONbits.TRAPR
#define _LVDL0 RCONbits.LVDL0
#define _LVDL1 RCONbits.LVDL1
#define _LVDL2 RCONbits.LVDL2
#define _LVDL3 RCONbits.LVDL3

/* OSCCON */
#define _OSWEN OSCCONbits.OSWEN
#define _LPOSCEN OSCCONbits.LPOSCEN
#define _CF OSCCONbits.CF
#define _LOCK OSCCONbits.LOCK
#define _POST OSCCONbits.POST
#define _NOSC OSCCONbits.NOSC
#define _COSC OSCCONbits.COSC
#define _POST0 OSCCONbits.POST0
#define _POST1 OSCCONbits.POST1
#define _NOSC0 OSCCONbits.NOSC0
#define _NOSC1 OSCCONbits.NOSC1
#define _NOSC2 OSCCONbits.NOSC2
#define _COSC0 OSCCONbits.COSC0
#define _COSC1 OSCCONbits.COSC1
#define _COSC2 OSCCONbits.COSC2

/* OSCTUN */
#define _TUN0 OSCTUNbits.TUN0
#define _TUN1 OSCTUNbits.TUN1
#define _TUN2 OSCTUNbits.TUN2
#define _TUN3 OSCTUNbits.TUN3

/* BSRAM */
#define _RL_BSR BSRAMbits.RL_BSR
#define _IR_BSR BSRAMbits.IR_BSR
#define _IW_BSR BSRAMbits.IW_BSR

